step_reports/real_overhead_suite/pd/logs/torch_decode_bench_run3.log
2026-04-16 19:37:59,853 - modelscope - INFO - Target directory already exists, skipping creation.
benchmark_args=Namespace(backend='sglang', base_url='http://127.0.0.1:8000', host='0.0.0.0', port=None, ready_check_timeout_sec=300, dataset_name='random', dataset_path='', model='LLM-Research/Meta-Llama-3.1-8B-Instruct', served_model_name=None, tokenizer='LLM-Research/Meta-Llama-3.1-8B-Instruct', num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file='/workspace/step_reports/real_overhead_suite/pd/results/torch_decode_bench_run3.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=4, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['GPU'], profile_start_step=5, profile_steps=50, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/workspace/step_reports/real_overhead_suite/pd/traces/torch_decode_torch_profile_run3', profile_prefix='torch_decode_run3', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=['http://127.0.0.1:30001'], flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 300s for http://127.0.0.1:8000/v1/models to become ready...
Server ready in 0.0s.
Fail to load tokenizer config with error=LLM-Research/Meta-Llama-3.1-8B-Instruct is not a local folder and is not a valid model identifier listed on 'https://huggingface.co/models'
If this is a private repository, make sure to pass a token having permission to this repo either by logging in with `hf auth login` or by passing `token=<your_token>`

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url='http://127.0.0.1:8000', host='0.0.0.0', port=30000, ready_check_timeout_sec=300, dataset_name='random', dataset_path='', model='LLM-Research/Meta-Llama-3.1-8B-Instruct', served_model_name=None, tokenizer='LLM-Research/Meta-Llama-3.1-8B-Instruct', num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file='/workspace/step_reports/real_overhead_suite/pd/results/torch_decode_bench_run3.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=4, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['GPU'], profile_start_step=5, profile_steps=50, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/workspace/step_reports/real_overhead_suite/pd/traces/torch_decode_torch_profile_run3', profile_prefix='torch_decode_run3', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=['http://127.0.0.1:30001'], flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

Downloading Model from https://www.modelscope.cn to directory: /root/.cache/modelscope/hub/models/LLM-Research/Meta-Llama-3.1-8B-Instruct
#Input tokens: 14272
#Output tokens: 6556
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Starting profiler...
async_request_profile api_url='http://127.0.0.1:30001/start_profile' body={'activities': ['GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None, 'output_dir': '/workspace/step_reports/real_overhead_suite/pd/traces/torch_decode_torch_profile_run3/1776368288.1300273', 'profile_prefix': 'torch_decode_run3'}
Profiler started for Decode-0 worker at http://127.0.0.1:30001
100%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 100/100 [00:08<00:00, 12.25it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     100       
Benchmark duration (s):                  8.16      
Total input tokens:                      14272     
Total input text tokens:                 14272     
Total generated tokens:                  6556      
Total generated tokens (retokenized):    6554      
Request throughput (req/s):              12.25     
Input token throughput (tok/s):          1748.01   
Output token throughput (tok/s):         802.97    
Peak output token throughput (tok/s):    1335.00   
Peak concurrent requests:                100       
Total token throughput (tok/s):          2550.98   
Concurrency:                             56.93     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   4648.47   
Median E2E Latency (ms):                 4695.86   
P90 E2E Latency (ms):                    7369.03   
P99 E2E Latency (ms):                    7895.20   
---------------Time to First Token----------------
Mean TTFT (ms):                          2665.87   
Median TTFT (ms):                        2972.54   
P99 TTFT (ms):                           5284.15   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.05     
Median TPOT (ms):                        26.49     
P99 TPOT (ms):                           63.90     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           30.71     
Median ITL (ms):                         23.86     
P95 ITL (ms):                            35.28     
P99 ITL (ms):                            53.32     
Max ITL (ms):                            1092.77   
==================================================
[W416 19:38:17.048107639 AllocatorConfig.cpp:28] Warning: PYTORCH_CUDA_ALLOC_CONF is deprecated, use PYTORCH_ALLOC_CONF instead (function operator())